#ifndef _CONFETTI_H_
#define _CONFETTI_H_
//=============================================================================
//
// 紙吹雪クラス [confetti.h]
// Author : Masuzawa Mirai
//
//=============================================================================

//=========================================================================
// インクルード
//=========================================================================
#include "scene2d.h"

//=========================================================================
// 前方宣言
//=========================================================================

//=========================================================================
// クラス定義
//=========================================================================
class CConfetti : public CScene2D
{
public:
    CConfetti(PRIORITY = PRIORITY_EFFECT); // コンストラクタ
    ~CConfetti();                     // デストラクタ

    static CConfetti *Create(D3DXVECTOR3 pos, D3DXCOLOR col, float fMoveAngle);   // インスタンス生成
    HRESULT Init();             // 初期化処理
    void Update();              // 更新処理
    void Draw();                // 描画
private:

    //============
    // メンバ変数
    //============
    int m_nLife;
    float m_fMoveAngle;
    float m_fMoveRate;
    float m_fAngle;
    D3DXVECTOR3 m_move;
};

#endif