#ifndef _DUMMY_MODEL_H_
#define _DUMMY_MODEL_H_
//=============================================================================
//
// テストモデルクラス [dummy_model.h]
// Author : masuzawa mirai
//
//=============================================================================

//=========================================================================
// インクルード
//=========================================================================
#include "model.h"

//=========================================================================
// クラス定義
//=========================================================================
class CDummyModel : public CModel
{
public:
    CDummyModel(PRIORITY = PRIORITY_MODEL); // コンストラクタ
    ~CDummyModel();                              // デストラクタ

    static CDummyModel *Create();    // インスタンス生成
    HRESULT Init();                 // 初期化処理
    void Uninit();                  // 初期化処理
    void Update();                  // 更新処理
    void Draw();                    // 描画

private:
};

#endif