#ifndef _JUDGE_FLIP_H_
#define _JUDGE_FLIP_H_
//=============================================================================
//
// ジャッジフリップクラス [judge_flip_2d.h]
// Author : Masuzawa Mirai
//
//=============================================================================

//=========================================================================
// インクルード
//=========================================================================
#include "scene2d.h"

//=========================================================================
// 前方宣言
//=========================================================================

//=========================================================================
// クラス定義
//=========================================================================
class CJudgeFlip : public CScene2D
{
public:
    enum JUDGE_FLIP_STATE
    {
        STATE_NONE = -1,
        STATE_WIN,
        STATE_LOSE,
        STATE_MAX
    };
    CJudgeFlip(PRIORITY = PRIORITY_UI); // コンストラクタ
    ~CJudgeFlip();                     // デストラクタ

    static CJudgeFlip *Create();   // インスタンス生成
    HRESULT Init();             // 初期化処理
    void Uninit();              // 初期化処理
    void Update();              // 更新処理
    void Draw();                // 描画

    void SetFlip(JUDGE_FLIP_STATE state);
private:
};

#endif