#ifndef _PRESENT_BOX_H_
#define _PRESENT_BOX_H_
//=============================================================================
//
// プレゼントボックスクラスクラス [present_box.h]
// Author : Masuzawa Mirai
//
//=============================================================================

//=========================================================================
// インクルード
//=========================================================================
#include "scene2d.h"

//=========================================================================
// 前方宣言
//=========================================================================

//=========================================================================
// クラス定義
//=========================================================================
class CPresentBox : public CScene2D
{
public:
    CPresentBox(PRIORITY = PRIORITY_CHARACTER); // コンストラクタ
    ~CPresentBox();                     // デストラクタ

    static CPresentBox *Create();   // インスタンス生成
    HRESULT Init();             // 初期化処理
    void Uninit();              // 初期化処理
    void Update();              // 更新処理
    void Draw();                // 描画
private:
};

#endif