//#ifndef _RANKING_H_
//#define _RANKING_H_
////=============================================================================
////
//// ランキングクラスヘッダー [ranking.h]
//// Author : Masuzawa Mirai
////
////=============================================================================
//
////=============================================================================
//// インクルード
////=============================================================================
//#include "scene2d.h"
//
////=============================================================================
//// マクロ定義
////=============================================================================
//#define MAX_NUMBER		(3)				// ナンバーの桁数
//#define MAX_RANKING		(5)				// ランキングの数  
//
////=============================================================================
//// 前置宣言
////=============================================================================
//class CNumber2d;
//
////=============================================================================
//// レンダラークラス
////=============================================================================
//class CRanking : public CScene2D
//{
//public:
//    struct RankData
//    {
//        int nData;
//        CNumber2d* apNumber[MAX_NUMBER];
//    };
//	CRanking(PRIORITY);				// コンストラクタ
//	~CRanking();			// デストラクタ
//
//	// メンバ関数
//    static CRanking * Create();
//	HRESULT Init(void);	// 初期化処理
//	void Uninit(void);											// 終了処理
//	void Update(void);											// 更新処理
//	void Draw(void);											// 描画処理
//    
//    void SetRabkData(int nData) { m_rankData[MAX_RANKING].nData = nData; }
//private:
//   
//    static RankData m_rankData[MAX_RANKING + 1];	// 桁数分
//};
//
//#endif